## Interview Query Question #5 | New Resumes

Good morning. Here's your python question for today.

This question was asked by: Ziprecruiter

In [1]:
existing_ids = [15234, 20485, 34536, 95342, 94857]

names = ['Calvin', 'Jason', 'Cindy', 'Kevin']
urls = [
    'domain.com/resume/15234', 
    'domain.com/resume/23645', 
    'domain.com/resume/64337', 
    'domain.com/resume/34536',
]

We have a list of existing ids that we have already scraped. Let's say we also have two lists, one of names and another of urls that correspond to the names in another list with the id of the names in the url.

Write code in Python to return the names and ids that we haven't scraped yet.

In [2]:
output = [('Jason', 23645), ('Cindy', 64337)]

In [3]:
# idea: left excluding join

In [6]:
import pandas as pd

In [18]:
# pandas dataframe for scraped ids
scraped = pd.DataFrame({'existing_ids': existing_ids})
scraped

   existing_ids
0         15234
1         20485
2         34536
3         95342
4         94857

In [19]:
# pandas dataframe for names, urls
everyone = pd.DataFrame({'names': names,
                        'urls': urls})
everyone

    names                     urls
0  Calvin  domain.com/resume/15234
1   Jason  domain.com/resume/23645
2   Cindy  domain.com/resume/64337
3   Kevin  domain.com/resume/34536

In [23]:
# extract id from url
everyone['id'] = everyone['urls'].apply(lambda x: int(x[-5:]))
everyone

    names                     urls     id
0  Calvin  domain.com/resume/15234  15234
1   Jason  domain.com/resume/23645  23645
2   Cindy  domain.com/resume/64337  64337
3   Kevin  domain.com/resume/34536  34536

In [34]:
# left excluding join 
joined = pd.merge(everyone, scraped, how='left', left_on='id', right_on='existing_ids')
joined

    names                     urls     id  existing_ids
0  Calvin  domain.com/resume/15234  15234       15234.0
1   Jason  domain.com/resume/23645  23645           NaN
2   Cindy  domain.com/resume/64337  64337           NaN
3   Kevin  domain.com/resume/34536  34536       34536.0

In [37]:
output = joined[joined.existing_ids.isnull()][['names', 'id']]
output

   names     id
1  Jason  23645
2  Cindy  64337

In [38]:
# format output
output.values.tolist()

[['Jason', 23645], ['Cindy', 64337]]